/* CLLocationManager error kCLErrorRangingFailure */
"A general ranging error occurred." = "A general ranging error occurred.";

/* CLLocationManager error kCLErrorRegionMonitoringFailure */
"A registered region cannot be monitored." = "A registered region cannot be monitored.";

/* CLLocationManager error kCLErrorDenied */
"Access to the location service was denied by the user." = "Access to the location service was denied by the user.";

/* CLLocationManager error kCLErrorRegionMonitoringDenied */
"Access to the region monitoring service was denied by the user." = "Access to the region monitoring service was denied by the user.";

/* CLLocationManager error kCLErrorRegionMonitoringSetupDelayed */
"Core Location could not initialize the region monitoring feature immediately." = "Core Location could not initialize the region monitoring feature immediately.";

/* CLLocationManager error kCLErrorRegionMonitoringResponseDelayed */
"Core Location will deliver events but they may be delayed." = "Core Location will deliver events but they may be delayed.";

/* CLLocationManager error kCLErrorDeferredDistanceFiltered */
"Deferred mode does not support distance filters." = "Deferred mode does not support distance filters.";

/* CLLocationManager error kCLErrorDeferredAccuracyTooLow */
"Deferred mode is not supported for the requested accuracy." = "Deferred mode is not supported for the requested accuracy.";

/* CLLocationManager error kCLErrorRangingUnavailable */
"Ranging is disabled. This might happen if the device is in Airplane mode or if Bluetooth or location services are disabled." = "Ranging is disabled. This might happen if the device is in Airplane mode or if Bluetooth or location services are disabled.";

/* CLLocationManager error kCLErrorGeocodeCanceled */
"The geocode request was canceled." = "The geocode request was canceled.";

/* CLLocationManager error kCLErrorGeocodeFoundPartialResult */
"The geocode request yielded a partial result." = "The geocode request yielded a partial result.";

/* CLLocationManager error kCLErrorGeocodeFoundNoResult */
"The geocode request yielded no result." = "The geocode request yielded no result.";

/* CLLocationManager error kCLErrorHeadingFailure */
"The heading could not be determined." = "The heading could not be determined.";

/* CLLocationManager error kCLErrorDeferredNotUpdatingLocation */
"The location manager did not enter deferred mode because location updates were already disabled or paused." = "The location manager did not enter deferred mode because location updates were already disabled or paused.";

/* CLLocationManager error kCLErrorDeferredFailed */
"The location manager did not enter deferred mode for an unknown reason." = "The location manager did not enter deferred mode for an unknown reason.";

/* CLLocationManager error kCLErrorLocationUnknown */
"The location manager was unable to obtain a location value right now." = "The location manager was unable to obtain a location value right now.";

/* CLLocationManager error kCLErrorNetwork */
"The network was unavailable or a network error occurred." = "The network was unavailable or a network error occurred.";

/* CLLocationManager error kCLErrorDeferredCanceled */
"The request for deferred updates was canceled by a subsequent call." = "The request for deferred updates was canceled by a subsequent call.";

